# Import pandas and SQLalchemy

In [1]:
import pandas as pd
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:postgres@localhost:5432/caseproject')
connection = engine.connect()

# Calculat Average Salary Using SQL join and GroupBy 
## Read Average using Read_SQL

In [2]:
data_df =pd.read_sql ('SELECT * FROM salaries ',connection)
data_df

        emp_no      salary
0        10001  $60,117.00
1        10002  $65,828.00
2        10003  $40,006.00
3        10004  $40,054.00
4        10005  $78,228.00
...        ...         ...
300019  499995  $40,000.00
300020  499996  $58,058.00
300021  499997  $49,597.00
300022  499998  $40,000.00
300023  499999  $63,707.00

[300024 rows x 2 columns]

In [3]:


data_df =pd.read_sql ('select title, ROUND(AVG(CAST(salary AS DEC)),2) \
as Average_Salary from salaries as s inner join employees as e on s.emp_no = e.emp_no \
inner join titles as t on t.title_id = e.emp_title_id group by title; ',connection)
data_df

                title  average_salary
0  Assistant Engineer        48564.43
1            Engineer        48535.34
2             Manager        51531.04
3     Senior Engineer        48506.80
4        Senior Staff        58550.17
5               Staff        58465.38
6    Technique Leader        48582.90